#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.bastion.data.digitalocean_image.this: Reading...
module.bastion.data.digitalocean_image.this: Read complete after 1s [name=7 x64]
module.bastion.digitalocean_droplet.this: Refreshing state... [id=374105188]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.bastion.digitalocean_firewall.this[0] will be created
  + resource "digitalocean_firewall" "this" {
      + created_at      = (known after apply)
      + droplet_ids     = [
          + 374105188,
        ]
      + id              = (known after apply)
      + name            = "bastion-fw"
      + pending_changes = (known after apply)
      + status          = (known after apply)

      + inbound_rule {
          + port_range                = "22"
          + protocol                  = "tcp"
          + source_addresses          = [
              + "0.0.0.0/0",
            ]
          + source_droplet_ids        = []
          + source_kubernetes_ids     = []
          + source_load_balancer_uids = []
          + source_tags               = []
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @cemdorst, Action: `pull_request`*